{
	"Home": "Стартовая",
	"Archive": "Архив",
	"Scores": "Результаты",
	"Daily score": "Результаты дня",
	"Rating": "Рейтинг",
	"Author": "Авторам",
	"Help": "Справка",
	"Logout": "Выйти",
	"Login": "Войти",
	"Author:": "Автор:",
	"Sorry, but your browser is not supported. Try to setup the new version.": "К сожалению, ваш браузер не поддерживается. Постарайтесь обновить версию.",
	"Start": "Старт",
	"Undo": "Отменить",
	"Pencil-marks": "Пометки",
	"Check": "Проверить",
	"Grid control": "Управление",
	"Click at a cell reveals the value chooser. Click at the selected value changes the state of the cell.": "Щелчок по клетке открывает панель выбора значений. Щелчок по выбранному значению меняет значение в клетке.",
	"To draw a line press the mouse button at a start cell and move mouse to another cell holding the button.": "Чтобы нарисовать линию нажмите кнопку мыши на стартовой ячейке и перемещайте мышь до финишной ячейки удерживая кнопку.",
	"Click the mouse button at the selected cell to change the filling of the cell.": "Щелкните кнопкой мыши на выбраной ячейке, чтобы изменить состояние ячейки.",
	"More details about grid control are at the": "Подробнее о том, как решать задачи смотрите на ",
	"help page": "странице справки",
	"welcome_page": "welcome_page_ru",
	"help_page": "help_page_ru",
	"Daily puzzles": "Задачи дня",
	"Date": "Дата",
	"Puzzle": "Задача",
	"Best score": "Лучшее время",
	"competitive": "зачётная",
	"Click at the puzzle name to solve the selected puzzle.": "Щёлкните по названию задачи, чтобы перейти к решению.",
	"Puzzles which are older than 5 days are non-competitive and can be attempted without registration.": "Задачи старше 5 дней незачётные и могут быть решены без регистрации.",
	"Click at the best solving time value to see the score table for the selected puzzle.": "Щелчок по лучшему времени открывает таблицу результатов по задаче.",
	"Set": "Выбрать",
	"error": {
		"one": "ошибка",
		"few": "ошибки",
		"other": "ошибок"
	},
	"Solvers Rating": "Рейтинг решателей",
	"(preliminary)": "(предварительно)",
	"Weekly change": "Изменение за неделю"
}
