{
	"Home": "Стартовая",
	"Archive": "Архив",
	"Scores": "Результаты",
	"Daily score": "Результаты дня",
	"Rating": "Рейтинг",
	"Admin": "Admin",
	"User stat": "User stat",
	"Help": "Справка",
	"Logout": "Выйти",
	"Login": "Войти",
	"Author:": "Автор:",
	"Sorry, but your browser is not supported. Try to setup the new version.": "К сожалению, ваш браузер не поддерживается. Постарайтесь обновить версию.",
	"Start": "Старт",
	"Undo": "Отменить",
	"Pencil-marks": "Пометки",
	"Check": "Проверить",
	"Yes": "Да",
	"No": "Нет",
	"Do you want to restart the puzzle? All progress will be lost!": "Хотите начать решение задачи сначала? Всё продвижение будет потеряно!",
	"Grid control": "Управление",
	"Click at a cell reveals the value chooser. Click at the selected value changes the state of the cell.": "Щелчок по клетке открывает панель выбора значений. Щелчок по выбранному значению меняет значение в клетке.",
	"To draw a line press the mouse button at a start cell and move mouse to another cell holding the button.": "Чтобы нарисовать линию, нажмите кнопку мыши на стартовой ячейке и перемещайте мышь до финишной ячейки, удерживая кнопку.",
	"Click the mouse button at the selected cell to change the filling of the cell.": "Щелкните кнопкой мыши на выбранной ячейке, чтобы изменить состояние ячейки.",
	"More details about grid control are at the": "Подробнее о том, как решать задачи, смотрите на ",
	"help page": "странице справки",
	"welcome_page": "welcome_page_ru",
	"help_page": "help_page_ru",
	"Daily puzzles": "Задачи дня",
	"Puzzle": "Задача",
	"Best score": "Лучшее время",
	"competitive": "конкурсная",
	"Click at the puzzle name to solve the selected puzzle.": "Щёлкните по названию задачи, чтобы перейти к решению.",
	"Puzzles which are older than 5 days are non-competitive and can be attempted without registration.": "Задачи старше 5 дней - не конкурсные и могут быть решены без регистрации.",
	"Click at the best solving time value to see the score table for the selected puzzle.": "Щелчок по лучшему времени открывает таблицу результатов по задаче.",
	"Date": "Дата",
	"Set": "Выбрать",
	"error": {
		"one": "ошибка",
		"few": "ошибки",
		"other": "ошибок"
	},
	"Solvers Rating": "Рейтинг решателей",
	"(preliminary)": "(предварительно)",
	"Weekly change": "Изменение за неделю",
	"This puzzle is competitive and you should log in to solve it! Check our <a href=\"/archive\">archive</a> to try puzzles without registration": "Эта задача конкурсная, и для её решения необходимо войти в свою учётную запись! На <a href=\"/archive\">странице архива</a> можно порешать задачи без регистрации.",
	"You should log in to solve this puzzle!": "Для решения задачи необходимо войти в свою учётную запись!",
	"OK": "OK",
	"The clue is not correct": "Задающее число неверно",
	"No 2x2 black squares are allowed": "Черные квадраты 2x2 не разрешены",
	"Black area should be connected": "Черная область должна быть связной",
	"All cells should be filled": "Все ячейки должны быть заполнены",
	"Area of one color should be connected": "Область одного цвета должна быть связной",
	"No 2x2 squares are allowed": "Квадраты 2x2 не разрешены",
	"All digits should be exactly once in every column": "Все цифры должны встречаться в столбце ровно один раз",
	"No 2x2 squares fully occupied with digits are allowed": "Квадраты 2x2, полностью занятые цифрами, не разрешены",
	"All digits should be exactly once in every row": "Все цифры должны встречаться в ряду ровно один раз",
	"All digits should be exactly once in every area": "Все цифры должны встречаться в области ровно один раз",
	"All digits should be exactly once in the diagonal": "Все цифры должны встречаться на диагонали ровно один раз",
	"Two cells connected by the knight move should contain different digits": "Клетки, соединенные ходом коня, должны содержать разные цифры",
	"Two cells sharing a point should contain different digits": "Клетки, имеющие общую точку, должны содержать разные цифры",
	"Each island should contain single": "Каждый остров должен иметь одну задающую",
	"All white cells should be connected to numbers": "Все белые клетки должны соединяться с цифрами",
	"Black cells should form rectangles": "Черные клетки должны образовывать прямоугольник",
	"Sides of a rectangle should be at least 2": "Стороны прямоугольника должны быть длины не менее двух",
	"Rectangles shouldn't touch": "Прямоугольники не должны касаться",
	"Wrong number of blackened cells in the column": "Неверное число закрашенных клеток в столбце",
	"Wrong number of blackened cells in the row": "Неверное число закрашенных клеток в ряду",
	"Wrong sum for the column": "Неверная сумма для столбца",
	"Wrong sum for the row": "Неверная сумма для ряда",
	"All cells should be painted": "Все клетки должны быть закрашены",
	"Wrong max length of painted cell block in the column": "Неверная максимальная длина закрашенного блока в столбце",
	"Wrong max length of painted cell block in the row": "Неверная максимальная длина закрашенного блока в ряду",
	"There should be single loop passing through all cells": "Необходимо посетить все клетки и цикл должен быть единым",
	"There should be single loop without bifurcations": "Должен быть один цикл без разветвлений",
	"The line should have turn at every circle": "Линия должна поворачивать в каждом кружке",
	"Every second turn of the line should be makred": "Каждый второй поворот должен быть отмечен кружком",
	"All letters should be exactly once in every row": "Все буквы должны встречаться в ряду ровно один раз",
	"All letters should be exactly once in every column": "Все буквы должны встречаться в столбце ровно один раз",
	"Wrong first letter in the row": "Первая буква в ряду неверная",
	"Wrong last letter in the row": "Последняя буква в ряду неверная",
	"Black cells should form single snake without bifurcations": "Черные клетки должны образовать змею без разветвлений",
	"All black cells should be part of single snake": "Все черные клетки должны быть частью змеи",
	"Snake shouldn't touch itself": "Змея не должна касаться себя",
	"Wrong sum of the first digits in the row": "Неверная сумма первых цифр в ряду",
	"Wrong sum of the last digits in the row": "Неверная сумма последних цифр в ряду",
	"Wrong number of visible buldings in the row": "Неверное число видимых зданий в ряду",
	"Each phone should be connected to one white circle": "Каждый телефон должен соединяться с одним белым кружком",
	"Each phone should be connected to one black circle": "Каждый телефон должен соединяться с одним черным кружком",
	"Wrong number of turns for the line": "Неверное число поворотов линии",
	"There should be single line without bifurcations": "Должна быть простая линия без разветвлений",
	"Each circle should be connected to a phone": "Каждый кружок должен быть соединен с телефоном",
	"Lines should pass through all cells": "Линии должны проходить через все клетки",
	"Cells with stars shouldn't touch": "Клетки со звездами не должны касаться",
	"Each row should have exactly two stars": "Должно быть ровно две звезды в каждом ряду",
	"Each column should have exactly two stars": "Должно быть ровно две звезды в каждом столбце",
	"Each outlined area should have exactly two stars": "Должно быть ровно две звезды в каждом области",
	"Wrong condition for the first two digits in the column": "Не выполняется условие для двух первых цифр столбца",
	"Wrong condition for the last two digits in the column": "Не выполняется условие для двух последних цифр столбца",
	"Wrong condition for the first two digits in the row": "Не выполняется условие для двух первых цифр ряда",
	"Wrong condition for the last two digits in the row": "Не выполняется условие для двух последних цифр ряда",
	"Bulbs shouldn't illuminate each other": "Лампочки не должны освещать друг друга",
	"All white cells should be illuminated": "Все белые клетки должны быть освещены",
	"The two digit number shouldn't be a perfect square": "Две цифры не должны образовывать точный квадрат",
	"The two digit number should be a perfect square": "Две цифры должны образовывать точный квадрат",
	"There should be single loop passing through some cells": "Должен быть единый цикл, проходящий через некоторые клетки",
	"Loop can't pass through the cell with digit": "Цикл не должен проходить через клетки с цифрами",
	"The diagonal should contain exactly three different digits": "Диагональ должна содержать ровно три разные цифры",
	"Author": "Авторам",
	"Cells shouldn't form 'chess' pattern": "Ячейки не должны создавать шахматный рисунок",
	"Cells should form 'chess' pattern": "Ячейки должны создавать шахматный рисунок",
	"Area should contain sequential numbers from 1 to N": "Область должна содержать последовательные числа от 1 до N",
	"Distance between digits is too small": "Расстояние между цифрами слишком маленькое",
	"didn't finish": "не закончено",
	"Wrong number of stars in the column": "Неверное число звезд в столбце",
	"Wrong number of stars in the row": "Неверное число звезд в ряду",
	"The arrow should point to one star": "Стрелка должна указывать на одну звезду",
	"Instant rating": "Instant rating",
	"All white cells should be connected to the edge of the grid": "Все белые клетки должны соединяться с краем сетки",
	"Wrong first fragment in the row": "Неверная длина первого фрагмента в ряду",
	"Wrong last fragment in the row": "Неверная длина последнего фрагмента в ряду",
	"Example puzzles": "Примеры",
	"Example puzzle": "Пример",
	"Show answer": "Показать ответ",
	"Daily puzzle": "Задача дня",
	"Sinlge example text": "Это пример задачи. Её можно решать точно так же, как и соревновательную задачу, но результат нигде не сохраняется. Чтобы увидеть правильный ответ, воспользуйтесь ссылкой \"Показать ответ\".",
	"Puzzle is already published, changes are not allowed!": "Puzzle is already published, changes are not allowed!",
	"About": "Описание",
	"List examples text": "Примеры позволяют лучше понять условия головоломок. Их можно решать так же, как и соревновательные головоломки, но результат нигде не сохраняется. Для каждого примера можно посмотреть правильный ответ.",
	"All black cells should be connected to the edge of the grid": "Все черные клетки должны соединяться с краем сетки",
	"White area should be connected": "Белая область должна быть связной",
	"object_placement": "Задачи на размещение объектов",
	"number_placement": "Задачи на размещение чисел",
	"polymino": "Задачи с пентамино/тетрамино",
	"painting": "Задачи на раскраску",
	"lines": "Задачи с проведением линий",
	"snakes": "Змеиные задачи",
	"latin_square": "Другие латинские квадраты",
	"sudoku": "Судоку",
	"division": "Задачи на разрезание",
	"other": "Другие задачи",
	"Wrong length of blackened fragment in the column": "Неверная длина закрашенного фрагмента в столбце",
	"Wrong length of blackened fragment in the row": "Неверная длина закрашенного фрагмента в ряду",
	"There should be single loop passing through all white cells": "Один цикл должен проходить через все белые клетки",
	"Loop can't pass through the black cell": "Цикл не должен проходить через черные клетки",
	"Loop shouldn't turn next to the black circle": "Цикл не должен поворачивать рядом с черным кружком",
	"Loop should turn next to the white circle": "Цикл должен поворачивать рядом с белым кружком",
	"Loop shouldn't turn at the white circle": "Цикл не должен поворачивать в клетке с белым кружком",
	"Loop should turn at the black circle": "Цикл должен поворачивать в клетке с черным кружком",
	"Loop should pass through all cells with circles": "Цикл должен проходить через все клетки с кружками",
	"Wrong digit reading along spiral": "Неверная цифра при чтении вдоль спирали",
	"#": "#",
	"Your time": "Ваше время",
	"Your score": "Очки",
	"Full results of the contest see at ": "Полные результаты конкурса можно найти на ",
	"the results page": "странице результатов",
	"Total": "Сумма",
	"Success rate": "Процент успеха",
	"Color": "Цвет",
	"Default": "По умолчанию",
	"Contrast": "Контрастный",
	"White": "Белый",
	"Puzzles by type": "Задачи по типам",
	"month0": "Январь",
	"month1": "Февраль",
	"month2": "Март",
	"month3": "Апрель",
	"month4": "Май",
	"month5": "Июнь",
	"month6": "Июль",
	"month7": "Август",
	"month8": "Сентябрь",
	"month9": "Октябрь",
	"month10": "Ноябрь",
	"month11": "Декабрь",
	"monthNone": "Без даты",
	"Each row should have exactly two circles": "В каждой строке должно быть два кружка",
	"Each column should have exactly two circles": "В каждом столбце должно быть два кружка",
	"Cells with circles shouldn't touch": "Клетки с кружками не должны касаться",
	"Wrong number of cells between circles in the row": "Неверное число пустых клеток между кружками в строке",
	"Wrong number of cells between circles in the column": "Неверное число пустых клеток между кружками в столбце",
	"An island must consist of 6 cells": "Остров должен состоять из 6 ячеек",
	"There should be 6 white islands": "Должно быть 6 белых островов",
	"Unpainted cells should contain different digits in row": "Числа в незакрашенных клетках не должны повторяться в строках и столбцах",
	"Blackened cells shouldn't sharing an edge": "Закрашенные клетки не могут касаться стороной",
	"See the rating computation rules at ": "Правила расчёта рейтинга смотрите на ",
	"Rating history": "История рейтинга",
	"Weekly performance": "Результат недели",
	"Type performance": "Результаты по типам",
	"Weekly performance shows the performance for daily puzzles solved during the corresponding week. It is nominated in universal scoring scale which allows to compare puzzles of different complexity.": "Результат недели показывает усредненные результаты решения задач дня, решённых на соответствующей неделе. Он представлен в универсальных рейтинговых очках, которые позволяют сравнивать результаты по задачам разной сложности.",
	"Rating is a cumulative value which is slowly adjusted every week towards the weekly performance. It shows long-term performance level.": "Рейтинг - накопительный результат, который медленно изменяется по результатам недели.",
	"puzzle": {
		"one": "задача",
		"few": "задачи",
		"other": "задач"
	},
	"Our contributors": "Наши авторы",
	"Puzzles": "Задачи",
	"Stars show the aproximate puzzle difficulty:": "Звёздочки показывают ориентировочную сложность задачи:",
	"minute": {
		"one": "минута",
		"few": "минуты",
		"other": "минут"
	},
	"solving time for an expert": "решения для эксперта",
	"Puzzle XL 2020": "Puzzle XL 2020",
	"Puzzle XL 2021": "Puzzle XL 2021",
	"dOubLESHOW": "dOubLESHOW",
	"dOubLESHOW 2": "dOubLESHOW 2",
	"dOubLESHOW 3": "dOubLESHOW 3",
	"dOubLESHOW 2x2": "dOubLESHOW 2x2",
	"Anniversary duel": "Anniversary duel",
	"6x6 duel": "6x6 duel",
	"Puzzle is already planned for publishing, deletion is not allowed!": "Puzzle is already planned for publishing, deletion is not allowed!",
	"Puzzle is already used, deletion is not allowed!": "Puzzle is already used, deletion is not allowed!",
	"Snake should have a head and a tail": "У змеи должны быть голова и хвост",
	"The length of the snake should be exactly equal to the given value": "Длина змеи должна быть в точности равна заданному значению",
	"Snake should turn in the cell with black circle": "Змея должна поворачивать в клетке с чёрным кружком",
	"Snake can't go through crossed cell": "Змея не должна проходить через клетку с крестиком",
	"Snake should go straight through the cell with white circle": "Змея должна проходить прямо через клетку с белым кружком",
	"Tetromino of the same type shoudln't share an edge": "Тетромино одного типа не должны касаться стороной",
	"Black cells in each area should form valid tetromino": "Закрашенные клетки в каждой области должны образовать тетромино",
	"no stars": "нет звёзд",
	"second": {
		"one": "секунда",
		"few": "секунды",
		"other": "секунд"
	},
	"Compiler:": "Составитель:",
	"Puzzle sets": "Подборки задач",
	"Most of this collections are intended to be used as a train sets for beginner solvers to understand puzzle rules and solving techniques.": "Большая часть этих поборок задумывалась как тренировочные комрлекты ориентированые на начинающих решателей чтобы лучше познакомиться с условиями задач и авработать некоторые подходы к решению.",
	"Below you can find the list of puzzle collections created by our authors.": "Тут представлен список подборок задач, подготовленных нашими авторами.",
	"Value in the grey cell should be bigger than value in the white cell": "Значение в серой клетке должно быть больше, чем значение в белой клетке",
	"Show history from": "Показать историю с",
	"to": "по",
	"Sequence of white cells cannot span more than two outlined areas": "Ряд из белых клеток не должен принадлежать более чем двум областям",
	"Cells with boats shouldn't touch each other and lighthouses": "Клетки с лодками не должны касаться друг друга и маяков",
	"White cell should contain odd digit": "В белой клетке должна быть нечётная цифра",
	"Shaded cell should contain even digit": "В серой клетке должна быть чётная цифра",
	"Contests": "Конкурсы",
	"Best time": "Лучшее время",
	"Shaded cell should contain odd digit": "В серой клетке должна быть нечётная цифра",
	"Every second straight segment of the line should be marked": "Каждый второй прямой участок должен быть отмечен кружком",
	"The line should go straight at the cell with circle": "Через клетку с кружком линия должна проходить прямо",
	"Path shouldn't touch itself": "Дорожка не должна касаться себя",
	"All black cells should be part of single path": "Все закрашеные клетки должны быть частью дорожки",
	"Black cells should form single path without bifurcations": "Закрашеные клетки должны образовывать дорожку без разветвлений",
	"Path shouldn't turn in the cell with digit": "Дорожка не должна поворачивать в клетке с числом",
	"Current puzzle": "Очередная задача",
	"Enroll": "Записаться",
	"Leave": "Отказаться",
	"Contest score": "Результат в турнире",
	"Time till contest start ": "До начала турнира осталось ",
	"Time till puzzle start ": "До начала решения задачи осталось ",
	"Time till puzzle finish ": "До окончания решения задачи осталось ",
	"Time is over": "Время вышло",
	"Time till contest finish ": "До окончания турнира осталось ",
	"Contest info": "Информация о турнире",
	"Here you can see the list of solvers who are already registered for paricipation in the contest": "Здесь вы видите список решателей зарегистрированных для участия в турнире",
	"Press the button if you don't want to participate": "Нажмите кнопку, если вы не хотите участвовать",
	"Presss the button if you want to paricipate": "Нажмите кнопку, если вы хотите участвовать",
	"You should <a href=\"/users/login\">Login</a> first to be able to register for participation": "Вы должны <a href=\"/users/login\">Войти</a> чтобы зарегистрироваться для участия",
	"Contest starts at ": "Турнир начнётся ",
	" and finishes at ": " и закончится ",
	"Contest finished at ": "Турнир закончился ",
	"Your opponent for the round: ": "Ваш соперник на этот раунд: ",
	"Awaiting seeding": "Ожидаем жеребьёвку",
	"Results": "Результаты",
	"Your don't have opponent for the round": "В этом раунде у вас нет соперника",
	"duel_help_page": "duel_help_page_ru",
	"Go to puzzle": "К задаче",
	"without opponent": "без соперника",
	"has finished solving in ": "завершил решение за ",
	"Puzzle is not available yet": "Задача ещё не доступна",
	"The circles along the line should alternate the color": "Цвет кружков должен чередоваться при следовании вдоль линии",
	"Tie-break score": "Доп.показатель",
	"Each area should contain all letters exactly once": "Каждая область должна содержать все буквы по одному разу",
	"Each area should contain exactly one circle": "В каждой области должен быть один кружок",
	"Each cell should belong to exactly one area": "Каждая ячейка должна принадлежать ровно одной области",
	"Circle should be at the center of rotational symmetry the area": "Кружок должен быть центром вращательной симметрии для области",
	"Clue should show the size of the area": "Число должно показывать размер область",
	"Each area should have recatangular shape": "Каждая область должна иметь прямоугольную форму",
	"Each area should have rectangular or square shape": "Каждая область должна иметь прямоугольную или квадратную форму",
	"Each area should contain exactly one clue": "В каждой области должно быть ровно одно число",
	"Each area should have the required size": "Размер области должен соответствовать указанному",
	"The digits should be consecutive": "Цифры должны быть последовательными",
	"The digits shouldn't be consecutive": "Цифры не должны быть последовательными",
	"The digits shouldn't be two times bigger one another": "Цифры не должны быть одна вдвое больше другой",
	"The digits should be two times bigger one another": "Одна цифра должна быть вдвое больше другой",
	"Clear cache": "Clear cache",
	"All areas should have the same size": "Все области должны быть одного размера",
	"Each area should contain exactly one white circle and one black circle": "В каждой области должен быть один белый и один черный кружок",
	"Loop should visit the area exactly two times": "Цикл должен посещать область ровно два раза",
	"Three cells in a row shouldn't contain the same digits": "Три ячейки подряд не должны содержать одинаковые цифры",
	"Bigger number can't be in the below adjacent cell": "В соседней ячейке ниже не может быть большего числа",
	"Start and end of the snake should be in the shaded areas": "Начало и конец змеи должны быть в отмеченных областях",
	"Two neigbouring cells in different areas can't both be unused by the loop": "Соседние клетки в разных областях не должны одновременно быть пустыми",
	"Loop should visit the area exactly one time": "Цикл должен посещать область ровно один раз",
	"Diagonal lines shouldn't form a loop": "Диагонали не должны формировать замкнутый цикл",
	"Each element should be used exactly once": "Каждый элемент должен быть использован ровно один раз",
	"Each marked area should form a tetromino": "Каждая отмеченная область должна образовывать тетрамино",
	"Elements shouldn't touch": "Элементы не должны касаться",
	"Each marked area should form a pentomino": "Каждая отмеченная область должна образовывать пентамино",
	"Elements should touch at marked nodes": "Элементы должны касаться в отмеченных вершинах",
	"Each area should contain exactly two clues": "В каждой области должно быть ровно два числа",
	"The size of an area should be strictly between numbers in area": "Размер области должен быть строго между значений чисел в этой области.",
	"Number of the ships should correspond to the given set": "Число кораблей должно соответствовать данному набору",
	"Each marked area should form a ship from the set": "Каждая отмеченная облпсть должна быть кораблём из набора",
	"Ships shouldn't touch": "Корабли не должны касаться",
	"Cells without dot between should be of different types": "Ячейки без точки между ними должны быть разного вида",
	"Cells with dot between should be of the same type": "Ячейки с точкой между ними должны быть одного вида",
	"Congratulations! The puzzle has been solved correctly!!": "Поздравляем! Задача решена верно!",
	"Save": "Сохранить",
	"Close": "Закрыть",
	"You can rate the quality of the puzzle": "Вы можете оценить качество задачи",
	"You can add a comment for the puzzle author. It will be shown anonymously.": "Вы можете написать комментарий автору задачи. Он будет показан анонимно.",
	"Difficulty:": "Сложность:",
	"Rating:": "Рейтинг:",
	"Author can not rate own puzzles!": "Author can not rate own puzzles!",
	"Nobody left comments for this puzzle": "Никто не написал комментария к этой задаче",
	"Solvers comments:": "Комментарии решателей:",
	"Puzzles to test": "Задачи для тестирования",
	"video_links": "video_links",
	"Explainer videos": "Обучающие видео",
	"List of video text": "Некоторые решатели используют задачи сайта чтобы записывать видео с объяснением способов решения головоломок. Эти видео могут быть очень полезны для понимания правил и методов решения. Большая часть видео в этом списке - на русском языке.<br>Пишите на <a href='mailto:puzzleduel.club@gmail.com'>puzzleduel.club@gmail.com</a> если вы хотите предложить видео для добавления в этот список.",
	"Each marked area should form a pentomino from the given set": "Каждая отмеченная область должна образовывать пентамино из данного набора",
	"Each element should be used exactly same number of times as given": "Каждый элемент должен быть использован ровно столько раз, сколько в данном наборе",
	"Each third cell used by pentomino should be marked": "Каждая третья клетка, использованая пентамино, должна быть отмечена",
	"Areas of the same shape shouldn't share an edge": "Области одинаковой формы не должны касаться стороной",
	"Each outlined area should have exactly one star": "Должна быть ровно одна звезда в каждой области",
	"Each area should be L-shaped": "Каждая область должны быть L-образной",
	"Each area should contain a circle in the corner": "Кружок должен располагаться в угловой клетке области",
	"L-shape with a black circle should have equal legs": "L-образная область с чёрным кружком должна иметь равные стороны",
	"L-shape with a white circle should not have equal legs": "L-образная область с белым кружком должна иметь неравные стороны",
	"Wrong product for the row": "Неверное произведение в ряду",
	"Wrong product for the column": "Неверное произведение в столбце",
	"There should be 2 digits in the column": "В столбце должно быть две цифры",
	"There should be 2 digits in the row": "В ряду должно быть две цифры",
	"Cells with digits shouldn't share an edge": "Клетки с цифрами не должны касаться стороной",
	"Shaded cells should form a domino": "Закрашеные клетки должны образовать домино",
	"The area should contain exactly 2 shaded cells": "В области должно быть две закрашеных клетки",
	"The length of the segment should be strictly between numbers at its ends": "Длина участа цикла должна быть строго между числами на его концах",
	"Two cells sharing an edge should contain different digits": "Ячейки, касающиеся стороной, должны содержать разные цифры",
	"All digits should be exactly two times in every area": "Все цифры должны встречаться в области ровно два раза",
	"All digits should be exactly two times in every row": "Все цифры должны встречаться в ряду ровно два раза",
	"All digits should be exactly two times in every column": "Все цифры должны встречаться в столбце ровно два раза",
	"Cells with tents cannot share a point": "Клетки с палатками не должны касаться",
	"Wrong number of tents in the row": "Неверное число палаток в ряду",
	"Wrong number of tents in the column": "Неверное число палаток в столбце",
	"Each tree should have one corresponding tent": "У каждого дерева должна быть одна соответствующая палатка",
	"The lines can't cross": "Линии не должны пересекаться",
	"The line from a clue shouldn't pass another clue or cell with a cross": "Линия от числа не должна проходить через клетку с крестом или другим числом",
	"Cells with digits shouldn't touch": "Ячейки с числами не должны касаться",
	"The cells must be filled up from the bottom up in the area": "В области клетки должны быть заполнены снизу вверх",
	"All digits should be exactly once in shaded area": "Все цифры должны встречаться в закрашеной области ровно один раз",
	"Four identical symbols shouldn't form a continious line": "Четыре идентичных символа не должны образовывать непрерывный ряд",
	"Wrong length of the shortest segment in the row": "Длина кратчайшего отрезка в ряду неверная",
	"Wrong length of the shortest segment in the column": "Длина кратчайшего отрезка в столбце неверная",
	"The arrow should point to exactly one black cell": "Стрелка должна показывать ровно на одну закрашеную клетку",
	"Twentyx 1/2-No numbers": "Twentyx 1/2-No numbers",
	"Each area should contain two cells": "В каждой области должно быть две клетки",
	"Each domino should be used once": "Каждое домино должно использоваться один раз",
	"The line should pass numbered cells in order": "Маршрут должен проходить через клетки с числами по-порядку",
	"The loop can't have an intersection outside of the marked cells": "Маршрут не может иметь пересечений кроме как в отмеченных клетках",
	"The loop should have an intersection at the marked cell": "Маршрут должен пересекать себя в отмеченной клетке",
	"The line shouldn't have turn at numbered cells": "Линия не должна поворачивать в клетке с числом",
	"Touching dominoes should contain the same value": "Касающиеся домино должны иметь равные значения",
	"Wrong sum of values in the column": "Неверная сумма в столбце",
	"Wrong sum of values in the row": "Неверная сумма в строке",
	"Best puzzles": "Лучшие задачи",
	"Worst puzzles": "Худшие задачи",
	"Non rated puzzles": "Задачи с малым числом голосов",
	"Show the best pouzzles": "Показать лучшие задачи",
	"Show non rated pouzzles": "Показать задачи с малым числом голосов",
	"Puzzle rating is recounted once per day, so any changes appears at this page witrh some delay.": "Рейтинг задач пересчитывается один раз в день, поэтому изменения появляются на этой странице с задержкой.",
	"All Puzzles": "Все задачи",
	"Puzzle XL 2022": "Puzzle XL 2022",
	"dOubLESHOW 6": "dOubLESHOW 6",
	"dOubLESHOW 7": "dOubLESHOW 7",
	"Solve replay for": "Ход решения",
	"All numbers in the area should be equal to the number of cells in the area containing a number": "Все числа должны быть равны количеству чисел в этой области.",
	"Each area should contain at least one number": "Каждая обведённая область должна содержать хотя бы одно число",
	"Two cells sharing a bold edge shouldn't contain the same numbers": "Две клетки разделенные жирной границей не должны содержать равных чисел",
	"Area occupied by the digits should be connected": "Группа клеток с числами должна быть связна",
	"Areas of the same size shouldn't share an edge": "Области одного размера не должны касаться стороной",
	"The size of an area should be equal to numbers in area": "Размер области должен быть равен задающим числам в области",
	"Nikoli month 1/2": "Nikoli month 1/2",
	"Nikoli month 2/2": "Nikoli month 2/2",
	"Puzzle XL": "Puzzle XL",
	"Other contests": "Другие конкурсы",
	"Area with a white circle should not be a square": "Белый кружок должен быть в неквадратной области",
	"Area with a black circle should be a square": "Черный кружок должен быть в квадратной области",
	"Clues should be fully inside a single area": "Задающие должны быть полностью внутри одной области",
	"Start date/time": "Дата/время старта",
	"Finish": "Финиш",
	"Edit date and time": "Изменить дату и время",
	"Date/time": "Дата/время",
	"Add a puzzle": "Добавить задачу",
	"Puzzle Id": "Id задачи",
	"Edit name": "Изменть название",
	"Title": "Заголовок",
	"Description": "Описание",
	" bottom solvers after end of the month will be downgraded to ": " худших решателей по итогам месяца будут переведены в ",
	" top solvers after end of the month will be promoted to ": " лучших решателей по итогам месяца будут повышены в ",
	"League ranking based on the number of daily puzzles of the month solved during the month without error submissions. The totol solving time is considered as an additional ranking parameter.": "В зачёт лиги учитывается количество задач дня решённых без ошибок в течение месяца. Общее число решённых задач и время решения учитывается как дополнительные показатели.",
	"dOubLESHOW 2x2x2": "dOubLESHOW 2x2x2",
	"Solved correctly": "Решено без ошибок",
	"Total solved / time": "Всего решено / время",
	"League scores": "Зачёт в лигах",
	"April 2023": "Апрель 2023",
	"May 2023": "Май 2023",
	"League winners": "Победители лиг",
	"Full league results": "Полные результаты"
}