{
	"Home": "Стартовая",
	"Archive": "Архив",
	"Scores": "Результаты",
	"Daily score": "Результаты дня",
	"Rating": "Рейтинг",
	"Author": "Авторам",
	"Help": "Справка",
	"Logout": "Выйти",
	"Login": "Войти",
	"Author:": "Автор:",
	"Sorry, but your browser is not supported. Try to setup the new version.": "К сожалению, ваш браузер не поддерживается. Постарайтесь обновить версию.",
	"Start": "Старт",
	"Undo": "Отменить",
	"Pencil-marks": "Пометки",
	"Check": "Проверить",
	"Yes": "Да",
	"No": "Нет",
	"Do you want to restart the puzzle? All progress will be lost!": "Хотите начать решение задачи сначала? Всё продвижение будет потеряно!",
	"Grid control": "Управление",
	"Click at a cell reveals the value chooser. Click at the selected value changes the state of the cell.": "Щелчок по клетке открывает панель выбора значений. Щелчок по выбранному значению меняет значение в клетке.",
	"To draw a line press the mouse button at a start cell and move mouse to another cell holding the button.": "Чтобы нарисовать линию нажмите кнопку мыши на стартовой ячейке и перемещайте мышь до финишной ячейки удерживая кнопку.",
	"Click the mouse button at the selected cell to change the filling of the cell.": "Щелкните кнопкой мыши на выбраной ячейке, чтобы изменить состояние ячейки.",
	"More details about grid control are at the": "Подробнее о том, как решать задачи смотрите на ",
	"help page": "странице справки",
	"welcome_page": "welcome_page_ru",
	"help_page": "help_page_ru",
	"Daily puzzles": "Задачи дня",
	"Date": "Дата",
	"Puzzle": "Задача",
	"Best score": "Лучшее время",
	"competitive": "конкурсная",
	"Click at the puzzle name to solve the selected puzzle.": "Щёлкните по названию задачи, чтобы перейти к решению.",
	"Puzzles which are older than 5 days are non-competitive and can be attempted without registration.": "Задачи старше 5 дней не конкурсные и могут быть решены без регистрации.",
	"Click at the best solving time value to see the score table for the selected puzzle.": "Щелчок по лучшему времени открывает таблицу результатов по задаче.",
	"Set": "Выбрать",
	"error": {
		"one": "ошибка",
		"few": "ошибки",
		"other": "ошибок"
	},
	"Solvers Rating": "Рейтинг решателей",
	"(preliminary)": "(предварительно)",
	"Weekly change": "Изменение за неделю",
	"This puzzle is competitive and you should log in to solve it! Check our <a href=\"/archive\">archive</a> to try puzzles without registration": "Эта задача конкурсная и для её решения необходимо войти в свою учётную запись! На <a href=\"/archive\">странице архива</a> можно порешать задачи без регистрации.",
	"You should log in to solve this puzzle!": "Для решения задачи необходимо войти в свою учётную запись!",
	"OK": "OK",
	"The clue is not correct": "Задающее число неверно",
	"No 2x2 black squares are allowed": "Черные квадраты 2x2 не разрешены",
	"Black area should be connected": "Черная область должна быть связной",
	"All cells should be filled": "Все ячейки должны быть заполнены",
	"Area of one color should be connected": "Область одного цвета должна быть связной",
	"No 2x2 squares are allowed": "Квадраты 2x2 не разрешены",
	"All digits should be exactly once in every column": "Все цифры должны встречаться в столбце ровно один раз",
	"No 2x2 squares fully occupied with digits are allowed": "Квадраты 2x2 полностью занятые цифрами не разрешены",
	"All digits should be exactly once in every row": "Все цифры должны встречаться в ряду ровно один раз",
	"All digits should be exactly once in every area": "Все цифры должны встречаться в область ровно один раз",
	"All digits should be exactly once in the diagonal": "Все цифры должны встречаться на диагонали ровно один раз",
	"Two cells connected by the knight move should contain different digits": "Клетки соединеннные ходом коня должны содержать разные цифры",
	"Two cells sharing a point should contain different digits": "Клетки имеющие общую точку должны содержать разные цифры",
	"Each island should contain single": "Каждый остров должн иметь одну задающую",
	"All white cells should be connected to numbers": "Все белые клетки должны соединяться с цифрами",
	"Black cells should form rectangles": "Черные клетки должны образовывать прямоугольник",
	"Sides of a rectangle should be at least 2": "Стороны прямоугольника должны быть длины не менее двух",
	"Rectangles shouldn't touch": "Прямойгольники не должны касатья",
	"Wrong number of blackened cells in the column": "Неверное число закрашенных клеток в столбце",
	"Wrong number of blackened cells in the row": "Неверное число закрашенных клеток в ряду",
	"Wrong sum for the column": "Неверная сумма для столбца",
	"Wrong sum for the row": "Неверная сумма для ряда",
	"All cells should be painted": "Все клетки должны быть закрашены",
	"Wrong max length of painted cell block in the column": "Неверная максимальная длина закрашенного блока в столбце",
	"Wrong max length of painted cell block in the row": "Неверная максимальная длина закрашенного блока в ряду",
	"There should be single loop passing through all cells": "Один цикл должен проходить через все клетки",
	"There should be single loop without bifurcations": "Цикл не должен иметь разветвлений",
	"The line should have turn at every circle": "Линия должна поворачивать в каждом кружке",
	"Every second turn of the line should be makred": "каждый второй поворот должен быть отмечен кружком",
	"All letters should be exactly once in every row": "Все буквы должны встречаться в ряду ровно один раз",
	"All letters should be exactly once in every column": "Все буквы должны встречаться в столбце ровно один раз",
	"Wrong first letter in the row": "Первая буква в ряду неверная",
	"Wrong last letter in the row": "Последняя буква в ряду неверная",
	"Black cells should form single snake without bifurcations": "Черные клетки должы образовать змею без разветвлений",
	"All black cells should be part of single snake": "Все черные клетки должны быть частью змеи",
	"Snake shouldn't touch itself": "Змея не должна касаться себя",
	"Wrong sum of the first digits in the row": "Неверная сумма первых цифр в ряду",
	"Wrong sum of the last digits in the row": "Неверная сумма последних цифр в ряду",
	"Wrong number of visible buldings in the row": "Неверное число видимых зданий в ряду",
	"Each phone should be connected to one white circle": "Каждый телефон должен соединяться с одним белым кружком",
	"Each phone should be connected to one black circle": "Каждый телефон должен соединяться с одним черным кружком",
	"Wrong number of turns for the line": "Неверное число поворотов линии",
	"There should be single line without bifurcations": "Должна быть простая линия без разветвлений",
	"Each circle should be connected to a phone": "Каждый кружок должен ьыть соединен с телефоном",
	"Lines should pass through all cells": "Линии должны проходить через все клетки",
	"Cells with stars shouldn't touch": "Клетки со звездами не должны касаться",
	"Each row should have exactly two stars": "Должно быть ровно две звезды в каждом ряду",
	"Each column should have exactly two stars": "Должно быть ровно две звезды в каждом столбце",
	"Each outlined area should have exactly two stars": "Должно быть ровно две звезды в каждом области",
	"Wrong condition for the first two digits in the column": "Не выполняется условие для двух первых цифр столбца",
	"Wrong condition for the last two digits in the column": "Не выполняется условие для двух последних цифр столбца",
	"Wrong condition for the first two digits in the row": "Не выполняется условие для двух первых цифр ряда",
	"Wrong condition for the last two digits in the row": "Не выполняется условие для двух последних цифр ряда",
	"Bulbs shouldn't illuminate each other": "Лампочки не должны освещать друг друга",
	"All white cells should be illuminated": "Все белые клетки должны быть освещены",
	"The two digit number shouldn't be a perfect square": "Две цифры не должны образовывать точный квадрат",
	"The two digit number should be a perfect square": "Две цифры должны образовывать точный квадрат",
	"There should be single loop passing through some cells": "Должен быть один цикл проходящий через некоторые клетки",
	"Loop can't pass through the cell with digit": "Цикл не должен проходит через клетки с цифрами",
	"The diagonal should contain exactly three different digits": "Диагональ должна содержать ровно три разные цифры",
	"Cells shouldn't form 'chess' pattern": "Ячейки не должны создавать шахматный рисунок",
	"Cells should form 'chess' pattern": "Ячейки должны создавать шахматный рисунок",
	"Area should contain sequential numbers from 1 to N": "Область должна содержать последовательные числа от 1 до N",
	"Distance between digits is too small": "Расстояние между цифрами слишком маленькое",
	"didn't finish": "не закончено"
}
